app/controllers/posts_controller.rb

  def index
    @posts = Post.all
    @authors = Author.all

    if !params[:author].blank?
      @posts = Post.where(author: params[:author])
---
SELECT "posts".* FROM "posts" WHERE (created_at >='2016-01-27 00:00:00.000000')
SELECT "authors".* FROM "authors"
SELECT "posts".* FROM "posts" WHERE "posts"."author_id" = 8